from .punkt import PunktSentenceTokenizer, PunktLanguageVars

class BulletPointLangVars(PunktLanguageVars):
    sent_end_chars = ('.', '?', '!', '\u0964')

    """Excludes some characters from starting word tokens"""
    _re_word_start = r"[^\(\"\`{\[:;&\#\*@\)}\]\-,\u0964]"


    """Characters that cannot appear within words"""
    _re_non_word_chars = r"(?:[?!)\";}\]\*:@\'\({\[]\।\u0964)"



tokenizer = PunktSentenceTokenizer(lang_vars = BulletPointLangVars())
sentences = tokenizer.tokenize("উপরাষ্ট্রপতি শ্রী এম ভেঙ্কাইয়া নাইডু সোমবার আই আই টি দিল্লির হীরক জয়ন্তী উদযাপনের উদ্বোধন করেছেন। অনলাইনের মাধ্যমে এই অনুষ্ঠানে কেন্দ্রীয় মানব সম্পদ উন্নয়নমন্ত্রী শ্রী রমেশ পোখরিয়াল ‘নিশাঙ্ক’  উপস্থিত ছিলেন। এই উপলক্ষ্যে উপরাষ্ট্রপতি হীরকজয়ন্তীর লোগো এবং ২০৩০-এর জন্য প্রতিষ্ঠানের লক্ষ্য ও পরিকল্পনার নথি প্রকাশ করেছেন।   অনুষ্ঠানে বক্তব্য রাখতে গিয়ে শ্রী নাইডু বলেছেন, জলবায়ু পরিবর্তন থেকে স্বাস্থ্য সমস্যা ౼ মানবজাতি আজ যে সমস্ত সমস্যার মুখোমুখি হচ্ছে, সেগুলিকে সমাধানের জন্য আইআইটি সহ অন্যান্য উচ্চ শিক্ষা প্রতিষ্ঠানের গবেষণার উপর গুরুত্ব দেওয়া উচিৎ। দেশের সমস্যাগুলির স্থিতিশীল সমাধানের ভারতীয় প্রতিষ্ঠানগুলি যখন এমন কিছু কাজ করবে, যাতে সমাজের উপর তার ইতিবাচক প্রভাব পরে, তাহলেই সেগুলি বিশ্বে সর্বশ্রেষ্ঠ প্রতিষ্ঠান হয়ে উঠতে পারবে।    সামাজিক বিভিন্ন সমস্যার সমাধান খুজতে বেসরকারি ক্ষেত্রকে,  শিক্ষাক্ষেত্রে গবেষণা ও উন্নয়নের জন্য খোলা মনে বিনিয়োগের তিনি আহ্বান জানিয়েছেন। আইআইটির ছাত্রছাত্রীদের  গ্রামীণ ভারত ও কৃষকদের নানা সমসয়ার সমাধান ছাড়াও কি করে পুষ্টিকর ও প্রোটিন সমৃদ্ধ শস্য উৎপ দন বৃদ্ধি করা যায়, শ্রী নাইডু  সেই বিষয়গুলি নিয়েও কাজ করার পরামর্শ দেন। উচ্চশিক্ষা প্রতিষ্ঠানগুলিকে এককভাবে নয়, শিল্প সংস্থাগুলির সঙ্গে জোট বেঁধে অতাধুনিক প্রযুক্তি উদ্ভাবন করতে হবে। এর ফলে দ্রুত ও ফলাফল ভিত্তিক নানা প্রকল্প বাস্তবায়নে সুবিধে হবে।   নতুন শিক্ষানীতির প্রসঙ্গে উপরাষ্ট্রপতি বলেছেন, ভারতকে আন্তর্জাতিক শিক্ষা প্রতিষ্ঠানের গন্তব্যে পরিণত করার জন্য এই নীতি সহায়ক হবে। উচ্চ শিক্ষা প্রতিষ্ঠানের মানোন্নয়নে সরকার, বিশ্ববিদ্যালয়, শিক্ষাবিদ ও বেসরকারী প্রতিষ্ঠানগুলিকে একযোগে কাজ করতে হবে।   আইআইটি দিল্লি শিল্পোদ্যোগ গড়ার কেন্দ্র হয়ে উঠছে বলে উপরাষ্ট্রপতি সন্তোষ প্রকাশ করেছেন। এই প্রসঙ্গে তিনি মানব সম্পদ উন্নয়ন মন্ত্রকের ‘উন্নত ভারত অভিযান’ কর্মসূচীতে দিল্লি আইআইটি অনুঘটকের ভূমিকা পালন করায় এই প্রতিষ্ঠানের প্রশংসা করেছেন।    শ্রী পোখরিয়াল, এই অনুষ্ঠানের উদ্বোধন করার জন্য উপরাষ্ট্রপতির প্রতি কৃতজ্ঞতা জানিয়েছেন। তিনি বলেছেন, আমাদের দেশের ছাত্রছাত্রীদের জন্য একটি আধুনিক ও উন্নত শিক্ষা ব্যবস্থা গড়ে তুলতে২০২০-র নতুন জাতীয় শিক্ষানীতি সহায়ক হবে। আইআইটি দিল্লির  গৌরবময় ৬০ বছরের উল্লেখ করে তিনি বলেছেন সারা দেশ যখন ভিড-১৯ মহামারীর বিরুদ্ধে লড়াই করছে, তখন আইআইটি দিল্লি নানাভাবে কারিগরি সহায়তা দিয়েছে, যা সময়োপযোগী ও মূল্যবান। বিগত ৫ বছরে এই শিক্ষা প্রতিষ্ঠানের শিক্ষক শিক্ষিকা ও ছাত্রছাত্রীরা ৫০০-র বেশী পেটেন্টের আবেদন করেছেন এবং তাঁদের ১০হাজারের বেশী গবেষণা পত্র বিভিন্ন আন্তর্জাতিক পত্র পত্রিকায় ছাপানো হয়েছে। ২০১৬ সালে সরকার এই প্রতিষ্ঠানকে যেখানে গবেষণার জন্য ১০০ কোটি টাকা দিয়েছিল, ২০১৯ সালে তা বেড়ে হয়েছে ৪০০ কোটি টাকা।    দিল্লি আইআইটির ডিরেক্টর অধ্যাপক ভি রামগোপাল রাও জানিয়েছেন, ২০৩০ সালের যে লক্ষ মাত্রা এই শিক্ষা প্রতিষ্ঠা  নিয়েছে, তার ফলে ছাত্রছাত্রী, প্রাক্তনী, শিক্ষক শিক্ষিকা ও কর্মীবর্গদের জীবনে ইতিবাচক প্রভাব পড়বে এবং আগামী দিনে দেশের প্রগতিতে তা সহায়ক হবে।   অনুষ্ঠানের দ্বিতীয় পর্বে অধ্যাপক দেবাঙ্খখর, অধ্যাপক এম বালাকৃষ্ণাণ বক্তব্য রাখেন। ‘আই আইটি দিল্লিঃ ৬০ বছরের উৎকর্ষতার স্মৃতিচারণা ও ভবিষ্যৎ পরিকল্পনা’ শীর্ষক এক আলোচনায় এই প্রতিষ্ঠানের প্রাক্তন ডিরেক্টর অধ্যাপক ভি এস রাজু, অধ্যাপক আর এস শিরোহী, অধ্যাপক সুরেন্দ্র প্রসাদ ও অধ্যাপক আর কে শেভগাওকর অংশ নেন।")
for sentence in sentences:
    print(sentence)


