തിരുവനന്തപുരം ∙ രാജ്യാന്തര വിമാനത്താവളത്തിന്‍റെ നടത്തിപ്പും മേല്‍നോട്ടവും അദാനി എന്‍റര്‍പ്രൈസസിനെ ഏല്‍പ്പിക്കാന്‍ കേന്ദ്രമന്ത്രിസഭ എടുത്ത തീരുമാനം പിന്‍വലിക്കണമെന്ന് ആവശ്യപ്പെട്ട് സര്‍വകക്ഷി യോഗം. മുഖ്യമന്ത്രി പിണറായി വിജയന്‍ വിളിച്ച സര്‍വകക്ഷി യോഗത്തില്‍ ബിജെപി ഒഴികെ എല്ലാ കക്ഷികളും വിമാനത്താവള സ്വകാര്യവല്‍ക്കരണത്തെ എതിര്‍ത്തു. നിയമ നടപടികള്‍ തുടരുന്നതിനൊപ്പം ഒറ്റക്കെട്ടായി ഈ വിഷയത്തില്‍ മുന്നോട്ടുപോകാന്‍ യോഗം തീരുമാനിച്ചു. 

വിമാനത്താവളത്തിന്റെ മേല്‍നോട്ടവും നടത്തിപ്പും സംസ്ഥാന സര്‍ക്കാരിന് മുഖ്യപങ്കാളിത്തമുള്ള സ്പെഷ്യല്‍ പര്‍പ്പസ് വെഹിക്കിളില്‍ നിക്ഷിപ്തമാക്കണം എന്നാണ് സംസ്ഥാന സര്‍ക്കാര്‍ ആവശ്യപ്പെട്ടത് എന്ന് മുഖ്യമന്ത്രി യോഗത്തില്‍ വ്യക്തമാക്കി. കേന്ദ്ര വ്യോമയാന മന്ത്രിക്ക് രണ്ടു തവണയും പ്രധാനമന്ത്രിക്ക് മൂന്നുവട്ടവും ഈ ആവശ്യമുന്നയിച്ച് കത്ത് എഴുതിയിട്ടുണ്ട്.  

സംസ്ഥാന ചീഫ് സെക്രട്ടറി, കേന്ദ്ര വ്യോമയാന സെക്രട്ടറിക്ക് കാര്യങ്ങള്‍ വിശദീകരിച്ച് എഴുതിയ കത്തില്‍ കേരള സ്റ്റേറ്റ് ഇന്‍ഡസ്ട്രിയല്‍ ഡവലപ്മെന്‍റ് കോര്‍പ്പറേഷന്‍ സംസ്ഥാന സര്‍ക്കാരിനുവേണ്ടി ബിഡില്‍ പങ്കെടുത്തുവെന്നും ഈ ഓഫര്‍ ന്യായമായത് ആയിരുന്നുവെന്നും പറഞ്ഞിരുന്നു. അദാനി എന്‍റര്‍പ്രൈസസ് കൂടുതല്‍ തുക ക്വാട്ട് ചെയ്തതിനാല്‍ അതേ തുക ഓഫര്‍ ചെയ്യാന്‍ സംസ്ഥാന സര്‍ക്കാര്‍ തയാറാണ് എന്നും അറിയിച്ചു.  

2003ല്‍ കേന്ദ്ര വ്യോമയാന മന്ത്രാലയം സംസ്ഥാന സര്‍ക്കാരിന് നല്‍കിയ ഉറപ്പില്‍, സംസ്ഥാന സര്‍ക്കാര്‍ വിമാനത്താവള വികസനത്തിനായി നല്‍കിയ സംഭാവനകള്‍ പരിഗണിച്ച് വിമാനത്താവളത്തിന്‍റെ മേല്‍നോട്ടവും നടത്തിപ്പും സംസ്ഥാന സര്‍ക്കാരിന്‍റെ സ്പെഷ്യല്‍ പര്‍പ്പസ് വെഹിക്കിളിന് നല്‍കാമെന്ന് പറഞ്ഞിരുന്നു.  

സംസ്ഥാന സര്‍ക്കാരിന് കൊച്ചി രാജ്യാന്തര വിമാനത്താവളം പൊതുപങ്കാളിത്തത്തോടെ വിജയകരമായി നടപ്പാക്കിയ അനുഭവ പരിജ്ഞാനമുണ്ട്.  ഇതേ മാതൃകയില്‍ തന്നെ കണ്ണൂര്‍ രാജ്യാന്തര വിമാനത്താവളവും നടത്തുന്നുണ്ട്. തിരുവനന്തപുരം രാജ്യാന്തര വിമാനത്താവളത്തിന്‍റെ മേല്‍നോട്ടവും നടത്തിപ്പും ഏറ്റെടുക്കാന്‍ ബിഡ് ചെയ്ത സ്വകാര്യ സംരംഭകന് ഇത്തരത്തിലുള്ള മുന്‍പരിചയമില്ല.  

2005-ല്‍ സംസ്ഥാന സര്‍ക്കാര്‍ എയര്‍പോര്‍ട്ട് അതോറിറ്റി ഓഫ് ഇന്ത്യക്ക് 23.57 ഏക്കര്‍ ഏറ്റെടുത്ത് സൗജന്യമായി തിരുവനന്തപുരം രാജ്യാന്തര വിമാനത്താവളത്തിന്‍റെ വികസനത്തിനായി നല്‍കിയിട്ടുണ്ട്. ഇതിനുപുറമേ, 18 ഏക്കര്‍ ഭൂമി കൂടി ഏറ്റെടുത്തു നല്‍കാനുള്ള നടപടികള്‍ ആരംഭിച്ചിട്ടുണ്ട്. ഏറ്റെടുത്ത് സൗജന്യമായി നല്‍കിയ ഭൂമിയുടെ വില എസ്പിവിയില്‍ സംസ്ഥാന സര്‍ക്കാരിന്‍റെ ഓഹരിയായി കണക്കാക്കണമെന്ന നിബന്ധനയിലാണ് ഇത് ഏറ്റെടുത്ത് നല്‍കിയത്.
 
തിരുവനന്തപുരം വിമാനത്താവളത്തിന് മുന്‍ തിരുവിതാംകൂര്‍ സംസ്ഥാനം നല്‍കിയ റോയല്‍ ഫ്ളയിങ് ക്ലബ്ബ് വക 258.06 ഏക്കര്‍ ഭൂമിയും വിമാനത്താവളത്തിന്‍റെ 636.57 ഏക്കര്‍ വിസ്തൃതിയില്‍ ഉള്‍പ്പെട്ടിട്ടുണ്ട്. ഇവയടക്കം കേന്ദ്ര തീരുമാനം തിരുത്തേണ്ടതിന്‍റെ അനിവാര്യത വ്യക്തമാക്കുന്ന വിഷയങ്ങള്‍ മുഖ്യമന്ത്രി യോഗത്തില്‍ അക്കമിട്ട് നിരത്തി.
 
പൊതുമേഖലയില്‍ നിലനിന്നപ്പോള്‍ വിമാനത്താവളത്തിന് നല്‍കിയ സഹായസഹകരണങ്ങള്‍ സംസ്ഥാന സര്‍ക്കാരിന്‍റെ ശക്തമായ അഭിപ്രായത്തെ മറികടന്നുകൊണ്ട് സ്വകാര്യവല്‍ക്കരിക്കപ്പെടുന്ന വിമാനത്താവളത്തിന് നല്‍കാന്‍ കഴിയില്ല. സുപ്രീംകോടതിയുടെ ഉത്തരവ് പ്രകാരം ഉള്ള കേസ് ഹൈക്കോടതിയില്‍ നിലനില്‍ക്കുന്നുണ്ട്.

നിയമനടപടികള്‍ സാധ്യമായ രീതിയില്‍ മുന്നോട്ടു കൊണ്ടുപോകാനുള്ള നിയമോപദേശം തേടുന്നുണ്ട്. രാഷ്ട്രീയ പാര്‍ട്ടികള്‍ ഏകാഭിപ്രായത്തോടെയുള്ള സമീപനം സ്വീകരിച്ച് സംസ്ഥാനത്തിന്‍റെ ഉത്തമ താല്‍പര്യം സംരക്ഷിക്കാനുള്ള സംയുക്ത തീരുമാനം കൈക്കൊള്ളണം. ഇതിന് എല്ലാവരുടെയും സഹകരണം അനിവാര്യമാണെന്ന് മുഖ്യമന്ത്രി പറഞ്ഞു.  

വിമാനത്താവളം സംസ്ഥാന സര്‍ക്കാരിന്‍റെ നേതൃത്വത്തിലുള്ള സംവിധാനമായി മാറണമെന്നാണ് പൊതുവികാരം. നമ്മുടേത് ന്യായമായ ആവശ്യമാണ്. അത് ലഭിക്കണമെന്നുള്ളതാണ് നാടിന്‍റെ ആവശ്യം. ഒരു ഘട്ടം വരെ കേന്ദ്രം അത് അംഗീകരിച്ചതാണ്. ആരു വിമാനത്താവളം എടുത്താലും സംസ്ഥാന സര്‍ക്കാരിന്‍റെ സഹകരണമില്ലാതെ നടത്തികൊണ്ടുപോകാനാകില്ല.

വികസന കാര്യങ്ങളില്‍ സര്‍ക്കാര്‍ സഹായം അത്യാവശ്യമാണ്. സംസ്ഥാനത്തോട് വെല്ലുവിളി നടത്തി വ്യവസായമറിയാവുന്നവര്‍ വരുമെന്ന് തോന്നുന്നില്ല. ഇക്കാര്യം കേന്ദ്ര സര്‍ക്കാരിന്‍റെ മുന്നില്‍ കത്തുമുഖേനയും നേരിട്ടും പറഞ്ഞതാണ്. സംസ്ഥാന സര്‍ക്കാരിനെ ഏല്‍പ്പിക്കാമെന്ന് ഉന്നതതലത്തില്‍ സംസാരിച്ചപ്പോള്‍ വാക്കു തന്നതാണ്. അത് മറികടന്നുപോയിരിക്കുന്നു.

വിമാനത്താവളം വിട്ടുകൊടുക്കാനാകില്ല. എല്ലാവരും ഒറ്റക്കെട്ടാണ്. ബിജെപിയുടേത് സാങ്കേതിക പ്രതിഷേധം മാത്രമാണ്. കാര്യങ്ങള്‍ മനസ്സിലാക്കിയാല്‍ അവരും പിന്‍മാറും. ഒന്നിച്ചു നിന്നാല്‍ നമുക്ക് ഈ തീരുമാനത്തെ മാറ്റിയെടുക്കാം. നിയമസഭയില്‍ ഒന്നിച്ച് നിലപാടെടുക്കാം. തലസ്ഥാന നഗരിയുടെ പ്രൗഡിക്കനുസരിച്ചുള്ള വിമാനത്താവളമാക്കി മാറ്റാം. നിയമസഭയില്‍ സ്വീകരിക്കേണ്ട നിലപാടുകള്‍ സ്പീക്കര്‍, പ്രതിപക്ഷ നേതാവ് എന്നിവരുമായി ആലോചിച്ച് തീരുമാനിക്കുമെന്നും മുഖ്യമന്ത്രി പറഞ്ഞു.  

സംസ്ഥാന സര്‍ക്കാര്‍ എടുക്കുന്ന എല്ലാ നടപടികള്‍ക്കും പ്രതിപക്ഷ നേതാവ് രമേശ് ചെന്നിത്തല പൂര്‍ണ പിന്തുണ പ്രഖ്യാപിച്ചു. ഒറ്റക്കെട്ടായി നിന്ന് നിയമസഭയില്‍ പ്രമേയം കൊണ്ടുവരുന്ന കാര്യത്തിലും അദ്ദേഹം പിന്തുണ നല്‍കി. അതീവ പ്രാധാന്യമുള്ള വിഷയത്തില്‍ ഉടന്‍ യോഗം വിളിച്ചതിന് കക്ഷിനേതാക്കള്‍ സര്‍ക്കാരിനെ അഭിനന്ദിച്ചു.

പ്രതിപക്ഷ നേതാവ് രമേശ് ചെന്നിത്തല, എം.വി.ഗോവിന്ദന്‍ മാസ്റ്റര്‍ (സിപിഎം), തമ്പാനൂര്‍ രവി (കോണ്‍ഗ്രസ് ), മന്ത്രി ഇ.ചന്ദ്രശേഖരന്‍, സി.ദിവാകരന്‍ (സിപിഐ), പി.കെ.കുഞ്ഞാലിക്കുട്ടി (മുസ്‌ലിം ലീഗ്), മന്ത്രി രാമചന്ദ്രന്‍ കടന്നപ്പള്ളി (കോണ്‍ഗ്രസ് എസ്), സി.കെ.നാണു (ജനതാദള്‍ എസ്), പി.ജെ.ജോസഫ് (കേരള കോണ്‍ഗ്രസ്), ടി.പി.പീതാംബരന്‍ മാസ്റ്റര്‍ (എന്‍സിപി), ഷെയ്ക് പി.ഹാരിസ് (ലോക് താന്ത്രിക് ജനതാദള്‍), എ.എ.അസീസ് (ആര്‍എസ്പി), ജോര്‍ജ് കുര്യന്‍ (ബിജെപി), മനോജ്കുമാര്‍ (കേരള കോണ്‍ഗ്രസ് ജെ), പി.സി.ജോര്‍ജ് എംഎല്‍എ എന്നിവര്‍ യോഗത്തില്‍ പങ്കെടുത്തു.
